package com.kh.spring11.service;

import org.springframework.stereotype.Service;

//한글 처리를 도와주는 코드를 가진 서비스(특히 초/중/종성 분리 및 병합, 검색)
//한글의 첫 글자 = 가(44032) = ㄱ + ㅏ + (없음)
//한글의 마지막 글자 = 힣(55203) = ㅎ + ㅣ + ㅎ
//한글은 종성 -> 중성 -> 초성 순으로 변하여 배치됨 
//패턴을 알아야 분해를 할 수 있다(각 파츠의 개수를 알아야함)
//초성은 19개 중성은 21개 종성은 28개
@Service
public class KoreanService {
	//초성
	private String[] cho = {
			"ㄱ", "ㄲ", "ㄴ", "ㄷ", "ㄸ", "ㄹ", "ㅁ", "ㅂ", 
			"ㅃ", "ㅅ", "ㅆ", "ㅁ", "ㅈ", "ㅉ", "ㅊ", "ㅋ",
			"ㅌ", "ㅍ", "ㅎ"
	};
	//중성
	private String[] jung = {
			"ㅏ", "ㅐ", "ㅑ", "ㅒ", "ㅓ", "ㅔ", "ㅕ", "ㅖ", 
			"ㅗ", "ㅘ", "ㅙ", "ㅚ", "ㅛ", "ㅜ", "ㅝ", "ㅞ",
			"ㅟ", "ㅠ", "ㅡ", "ㅢ", "ㅣ"
	};
	//종성(28개)
	private String[] jong = {
			"", "ㄱ", "ㄲ", "ㄳ", "ㄴ", "ㄵ", "ㄶ", "ㄷ", "ㄹ", 
			"ㄺ", "ㄻ", "ㄼ", "ㄽ", "ㄾ", "ㄿ", "ㅀ", "ㅁ", "ㅂ", "ㅄ", 
			"ㅅ", "ㅆ", "ㅇ", "ㅈ", "ㅊ", "ㅋ", "ㅌ", "ㅎ"
	};
	

}
