package loop2;

public class Test04런닝시간계산기home2 {
	public static void main(String[] args) {
		
//		1일 - 1회차 - 20분
//		2일 - 휴일
//		3일 - 2회차 - 20분 
//		4일 - 휴일
//		5일 - 3회차 - 20분
//		6일 - 휴일
//		7일 - 4회차 - 20분 
//		8일 - 휴일
//		9일 - 5회차 - 25분 
//		10일 - 휴일 
//		11일 - 6회차 - 25분
//		12일 - 휴일 
//		13일 - 7회차 - 25분 
//		14일  - 휴일 
//		15일 - 8회차 - 30분 
//		16일 - 휴일 
//		17일 - 9회차 - 30분
//		18일 - 휴일 
//		19일 - 10회차 - 30분
//		20일 - 휴일 
//		21일 - 11회차 - 30분 
//		22일 - 휴일 
//		23일 - 12회차 - 35분 
//		24일 -  휴일 
//		25일 - 13회차 - 35분
//		26일 - 휴일 
//		27일 - 14회차 - 35분
//		28일 - 휴일 
	}
	
}
