package api.string2;

public class Test04생년월일검사 {
	public static void main(String[] args) {
		
		//다음 규칙에 맞게 생년월일 검사식을 구현해보세요
		//-날짜 형식은 'yyyy-mm-dd'형식
		//-연도(YYYY)는 1900부터 2099까지 설정가능
		//-월(MM)은 01부터 12까지 설정 가능
		//-일(DD)은 01부터 31까지 설정 가능 
		
//		최초 구현 시 월 상관없이 모든 달이 31까지 일자를 설정할 수 있게 구현하세요
//		다 구현하고 나서 월별로 '28', '30', '31'을 구분하여 설정할 수 있도록 업그레이드 하시기 바랍니다. 
		
		//연도 조건식 
		String yyyy = "^(1[90][0-9]{2}|2[0][1-9]{2})$";
		
		//월 조건식
		String mm = "^(0[1-9]|1[0-2])$";
		
		//일 조건식
		
		String dd = "^(0[1-9]|[12][1-9]|3[01])$";
		
		String myBirthday = "1990-05-16";
		
		//생년월일 조건식 
		String regex = "^(1[90][0-9]{2}|2[0][1-9]{2})-(0[1-9]|1[0-2])-(0[1-9]|[12][1-9]|3[01])$";
		
		boolean valid = myBirthday.matches(regex);
		System.out.println("생년월일 형식에 맞나요? " + valid);
		
		//이와중에 월별 일자수 구분 설정을 if문으로 한다. 
		if(valid) {
			
		}
		
	}

}
